{
  "storymap": {
    "slides": [
      {
        "type": "overview",
        "text": {
          "headline": "",
          "text": "<p>When you're not toting a briefcase or late for a meeting, each of the 18 stations along the Green Line has its own quirky, pause-worthy reason to get off and take a look around.</p><p><a href='//www.minnpost.com/stroll/2014/06/hockey-hip-hop-and-other-green-line-highlights'>Last week</a>, we highlighted the neighborhoods around stations from the West Bank to Hamline. Here's a round-up of the treasures we discovered from Lexington to Bedlam Lowertown &mdash; everything from teeny-tiny train replicas to an iconic copper <em>zwiebelturm</em>, pork-belly sandwiches to die for, and a palm reader who knows all.</p><p>Go ahead: Pull out all the stops.</p>"
        }
      },

      {
        "location": {
          "name": "Lexington Parkway",
          "lat": 44.955741,
          "lon": -93.14661,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Lexington Parkway",
          "text": "<p><strong>Scale Model Supplies, 458 Lexington Pkwy. N.</strong></p><p>In the back of the strip mall at Lexington and University, on the basement level, you will find this enormous warehouse containing any miniature vehicle you can imagine. Once a bowling alley, Scale Model Supplies carries airplanes, tanks, trains, rockets, slot cars, or anything else that moves. It's floor-to-ceiling, and it goes on for aisle after aisle. It seemed like an obvious question, but I couldn't help but ask it: in fact, yes they do carry model Siemens Light Rail Vehicles, the rolling stock used on the Green Line. There are no Metro Transit decals, but they'll sell you the Testors enamel to paint it blue and yellow yourself. Scale Model Supplies also carries Northstar Line-branded Motive Power MP36PH-3C engines and Bombardier BiLevel Coaches, should you be working on a model railroad setup of every commuter train in use in the seven-county metro.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]10-lexington.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Victoria Street",
          "lat": 44.955721,
          "lon": -93.136478,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Victoria Street",
          "text": "<p><strong>Fatima Spiritual Psychic, 822 University Av. W.</strong></p><p>Fatima has been reading Tarot and palms for more than 40 years in this century-old frame house on University. In fact, her son may usher you into the house through the front door, which was the case when I visited. The inside of the house looks like the sort of cozy, wall-papered home you might expect, with religious imagery of all kinds &mdash; statues, framed prints, icons. There's a table right by the door, with candles, a Tarot deck, and other items, where Fatima will pull you up a seat. It's about $65 for a full reading, and you can get your palm read for significantly less. You don't tell her anything before starting. You don't need to.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]11-victoria.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Dale Street ",
          "lat": 44.955717,
          "lon": -93.12629,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Dale Street ",
          "text": "<p><strong>Church of St. Agnes, 548 Lafond Av.</strong></p><p>The copper <em>zwiebelturm</em> (onion tower) of St. Agnes looms over Frogtown like little else in this section of the city. It's one of the first things you see coming off the platform, towering over the roofs of the rows of houses on Edmund, Charles and Sherburne north of University Avenue. Built by German and Eastern European immigrants in the early 20th century in the style of an Austrian abbey church, it seems largely unchanged since that time. As would have been the case then, there is a Latin Mass every Sunday. The four enormous bells in the tower toll, signaling the Mass &mdash; a sound easily heard from the anywhere in the neighborhood.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]12-dale.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Western Avenue",
          "lat": 44.95577,
          "lon": -93.116131,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Western Avenue",
          "text": "<p><strong>Ha Tien Market, 353 University Av. W.</strong></p><p>The fa&ccedil;ade at Ha Tien grocery store &mdash; glass blocks, theater marquee &mdash; suggests that it must have been an old movie house at one time. It wasn't. In fact, it was built in the art deco-ish style in 1986 to house the Frogtown Diner, a retro eatery that came in at the wrong end of the decade-long &ldquo;Happy Days&rdquo; craze. Ha Tien is one of the established Southeast Asian groceries in this stretch of University Avenue's Little Mekong district, operated by the Dao family since the mid-1990s. The inside is a bustling grocery and deli, highly regarded for its banh mi. I was particularly jealous of a good-looking pork belly sandwich the man behind me in line had. He was a regular who lived a few blocks away. &ldquo;The owner picked this out for me himself,&rdquo; he said. &ldquo;So I know it's perfect. Cut this into cubes, and it just melts. Throw it in with some basmati rice and Worcestershire sauce, and you've got dinner.&rdquo;</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]13-western.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Rice Street",
          "lat": 44.955641,
          "lon": -93.10507,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Rice Street",
          "text": "<p><strong>Leif Erikson statue</strong></p><p>There is an interesting theory on the Scandinavian side of my friends Stu and Mel's family about this 13-foot-high statue of Leif Erikson, sculpted in 1949 by John K. Daniels. The fact that Leif Erikson faces west, away from Norway and away from home, is a terrible violation of the Norwegian idea of <em>hjemkomst</em>, or <em>homecoming</em>. Leif is in this new world, the story goes, but to be placed here turning his back on his homeland can only bring ill tidings. Take, for example, the statue of the Swedish chronicler of the immigrant experience Vilhelm Moberg in Lindstrom, Minnesota. Moberg stands with his bike, but his head is turned east, toward home, as it should be. Until Erikson faces east, back toward Scandinavia, the Minnesota Vikings, named in honor of his people, will never win a Super Bowl. Or so Mel's father says.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]14-rice.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Robert Street",
          "lat": 44.954117,
          "lon": -93.097604,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Robert Street",
          "text": "<p><strong>National Guard Armory, 600 Cedar St.</strong></p><p>You can find a small museum experience anywhere you're willing to look for it, no matter how unlikely the setting may seem. The National Guard Armory fits the bill. A really striking modernist glass-and-steel building built in 1962, it bears all the imprints of the post-WWII, pre-Vietnam era in American civic life: confidence, technocratic optimism, a dollop of self-importance, down to those lathe-cut metal capital letters spelling out the name out front. The entry hall is quite impressive, with an array of historic and revolutionary flags flying overhead, a brief history lesson in American vexillology. Not just the greatest hits, like the Bennington and Moultrie, but some of the more arcane selections, too, like one of my personal favorites, General Washington's pine tree standard.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]15-robert.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Tenth Street",
          "lat": 44.950722,
          "lon": -93.097624,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Tenth Street",
          "text": "<p><strong>Church of Scientology, 505 Wabasha St.</strong></p><p>It is difficult to believe now that the old Science Museum of Minnesota expansion, built in 1978, could have ever housed anything other than the Church of Scientology, which acquired the building a few years ago. Sitting kitty-corner to the Fitzgerald Theater, the imposing quality of the rounded, front-facing fa&ccedil;ade seems built for it, emblazoned with the S-and-two-triangles Scientology emblem and flanked by banners. The central location in a sleepy district of downtown St. Paul, within range of Keillor's home base, the State Capitol, and the ivy-covered churches and apartments around it, makes the structure appear all the more theatrical and unapologetically assertive. Outside on the sidewalk there are offers for the public programming within the vast interior space &mdash; including, of course, the opportunity to take a personality test.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]16-tenth.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Central Business District",
          "lat": 44.946097,
          "lon": -93.092241,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Central Business District",
          "text": "<p><strong>St. Paul Athletic Club, 340 Cedar St.</strong></p><p>The St. Paul Athletic Club looks like one of those places that you shouldn't be able to walk into, but you can. Or at least you can walk through the lobby and lower levels, all of which are an impossibly lavish complex of dark wood, chandeliers, and fireplaces. (Have you noticed, actually, that most of those I-shouldn't-be-allowed-to-be-here-but-here-I-am sorts of places tend to be in St. Paul? This is the sort of amenity, it occurred to me, that explains why people love living in St. Paul.) The plasterwork, ornamentation and other details throughout are enough to make you consider signing up for a membership and begin training for the 1920 Summer Olympics in Antwerp. You can enter directly from the platform-to-skyway link, which is convenient, but you miss the thrill of entering through the front lobby.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]17-central.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "location": {
          "name": "Union Depot",
          "lat": 44.948209,
          "lon": -93.086795,
          "zoom": 16,
          "line": true
        },
        "text": {
          "headline": "Union Depot",
          "text": "<p><strong>Bedlam Lowertown, 213 E. Fourth St.</strong></p><p>The end of the line. You may remember the old Bedlam Theater space, located right by the Cedar-Riverside station on the Blue Line from 2006 to 2010 &mdash; it was one of the best gathering places in Minneapolis, and its absence stung. But that's all over! Using the same bar/restaurant/social club/performance space model, Bedlam Lowertown opened this month with a full bar, menu and calendar of upcoming events. The interior has been impressively renovated, and there's even one of those great Lowertown alleys behind the space. Bedlam is open until 2 a.m. every night, and the train runs 24 hours a day. See you there.</p>"
        },
        "media": {
          "url": "[[[IMAGE_PATH]]]18-union_depot.jpg",
          "credit": "MinnPost photo by Carrie Thompson",
          "caption": ""
        }
      },

      {
        "type": "overview",
        "text": {
          "headline": "",
          "text": "<p>Curious about the <strong>other new stops on the Green Line</strong>? Check out <a href='//www.minnpost.com/stroll/2014/06/hockey-hip-hop-and-other-green-line-highlights'>last week's Stroll</a>.</p>"
        }
      }
    ]
  }
}
